
// 가위 바위 보 하는 함수 (선공 정하는 함수)
    // return = 선공이 누군지
    // input = 유저가 어떤 값을 내는지 (가위, 바위, 보)


// let 선공결정_유저선택 = prompt( `선공정하기, 가위, 바위, 보!` );

// let 컴터가선택할수있는경우의수 = ["가위", "바위", "보"];
// let 선공결정_컴터선택 = 컴터가선택할수있는경우의수[parseInt(Math.random() * 3 + 1)];

// let play = true;

// let 선공 = "미정"




// 선공결정 가위바위보 경우의수 관련 함수
function 선공결정_비김() {
    // 결과 = 비김
    result = "비겼어. 다시 해"
    alert(`${result}`)

    // 다시 가위바위보 해야 함. 
    선공결정_유저선택 = prompt( `비겼네요~, 다시, 가위, 바위, 보!` );
    선공결정_컴터선택 = 컴터가선택할수있는경우의수[parseInt(Math.random() * 3 + 1)];

    // while 문을 나가도 될지 여부
    play = true;
    // 그 다음 while 로 가게 해야 함 
        // 방법 1) continue? 2) break? 3) 암것도 안 쓰기? 

    //continue; // 반복문의 처음으로 간다. 
    // 여기에서 break 를 하면 -> switch 를 나가는거 아닌가? -> 그러면, continue 랑 동일한 효과? ❓❓❓
}

function 선공결정_유저이김() {
    // 결과 = 유저 이김
    result = "유저이김"
    
    // 선공 변화
    선공 = "유저";
    
    alert(`${result}, 선공은 ${선공}`)
    // while 문을 나가도 될지 여부
    play = false;
    // continue;
}

function 선공결정_컴터이김() {
// 결과 = 컴터 이김 (이것도 함수로 해도 될거 같긴한데)
result = "컴터이김"

// 선공 변화 
선공 = "컴퓨터";

alert(`${result}, 선공은 ${선공}`)

// while 문을 나가도 될지 여부
// 1) false 만 해도 나가지 않을까? ❓❓❓❓❓ 
play = false;
// continue;

}



// 선공결정, 가위바위로 게임하는 함수 선언
function 선공결정_가위바위보 () {

    
let 선공결정_유저선택 = prompt( `선공정하기, 가위, 바위, 보!` );

let 컴터가선택할수있는경우의수 = ["가위", "바위", "보"];
let 선공결정_컴터선택 = 컴터가선택할수있는경우의수[parseInt(Math.random() * 3 + 1)];

let play = true;

let 선공 = "미정"



    // 선공결정 가위바위보 
    while (play) {
    
        switch (선공결정_유저선택) {
            case "가위":
        
                    if(선공결정_컴터선택 == "가위") {
                        선공결정_비김()
                        
                    } else if (선공결정_컴터선택 == "바위") {
                        선공결정_컴터이김()
    
                    } else {
                        선공결정_유저이김()
                    }
                
                break;
        
                
            case "바위":
        
                    if(선공결정_컴터선택 == "가위") {
                        선공결정_유저이김()
                        
                    } else if (선공결정_컴터선택 == "바위") {
                        선공결정_비김()
                        
                    } else {
                        선공결정_컴터이김()
                    }
                
                break;
                
                
            case "보":
        
                    if(선공결정_컴터선택 == "가위") {
                        선공결정_컴터이김()
                        
                    } else if (선공결정_컴터선택 == "바위") {
                        선공결정_유저이김()
                        
                    } else {
                        선공결정_비김()
                    }
                
                break;
    
            default:
                선공결정_유저선택 = prompt( `오타 났어~ 가위, 바위, 보! 를 정확히 입력해야 해` );
                play = true;            
                break;
        }
    
    }

    // ✅ return 
    return 선공;

}


// 선공결정, 가위바위로 게임하는 함수 실행
console.log(`${선공결정_가위바위보()}`)








// 배팅 금액 정하는 함수 
    // return = 필요없을듯? 
    // input : 내가 얼마를 배팅할 건지 




// 묵찌빠 함수 
    // input : 유저가 가위, 바위, 보 중 어떤 걸 내는지
    // return : 남은돈, 몇번째 판했는지? 



